ХамелионЦРПТ/src/Catalogs/Пользователи_ХамелеонЦРПТ/Пользователи_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи_ХамелеонЦРПТ</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>EnumRef.Сайты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияСН</name>
    <type>
      <types>EnumRef.СпособФормированияСН_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИ</name>
    <type>
      <types>EnumRef.ВидСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидМаркировки_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовленияСИ</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрокси</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПрокси</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатТумбер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PIN</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННСертификата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеСертификата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСерийныеНомераАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСайтаСУЗ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключатьсяКGS1Автоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенКСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьPDFнаДиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСохранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Демо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СайтыВходаВСистему</name>
    <type>
      <types>CatalogRef.ВходВСистему_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВводаВОборот</name>
    <type>
      <types>EnumRef.ТипыДокументаВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РегисстрационныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиентаМДЛП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СекретныйКодМДЛП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМПоУмолчанию</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМТабакПоУмолчанию</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКМ</name>
    <type>
      <types>EnumRef.СтатусыКМДляАгрегации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнийСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_ХС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_Площадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольМеркурий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтранаПроизводства_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПринятогоРешения</name>
    <type>
      <types>CatalogRef.КодПринятогоРешения_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИОтправлятьВводВОборотПослеЭмитирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючДляРаботыСНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинДляСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольДляСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРазработчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключенияСБ</name>
    <type>
      <types>EnumRef.ТипыПодключенияКЭДОСБ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинКонтур</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольКонтур</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ВЭБ_Меркурий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлюсЧасовойПоясДляЛекарств</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПеремаркировки</name>
    <type>
      <types>EnumRef.ТипДокументаПеремаркировки_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучитьТокен</name>
    <type>
      <types>EnumRef.ТипПолученияТокенаИзПользователя_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>omsConnection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрацииУчтенойСистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаХС</name>
    <attributes>
      <name>ГУИД_ХС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПлощадок</name>
    <attributes>
      <name>ГУИД_Площадок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_ВЭБ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГУИД_ХС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ХамелионЦРПТ/src/Enums/Сайты_ХамелеонЦРПТ/Сайты_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Сайты_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>МеховыеИзделия</name>
  </enumValues>
  <enumValues>
    <name>Лекарства</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ/Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</name>
  <enumValues>
    <name>_44_Фармацевтика</name>
  </enumValues>
  <enumValues>
    <name>_88_Фармацевтика</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ/Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Блок</name>
  </enumValues>
  <enumValues>
    <name>Пачка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ТипОплаты_ХамелеонЦРПТ/ТипОплаты_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОплаты_ХамелеонЦРПТ</name>
  <enumValues>
    <name>ОплатаПоНанесению</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоЭмиссии</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Catalogs/Пользователи_ХамелеонЦРПТ/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	Если не значениеЗаполнено(Сайт) Тогда
		Сайт=Перечисления.Сайты_ХамелеонЦРПТ.Обувь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование=ЭтотОбъект.КонтактноеЛицо;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ШаблонКМПоУмолчанию) Тогда
		ШаблонКМПоУмолчанию=Перечисления.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ._44_Фармацевтика;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ШаблонКМТабакПоУмолчанию) Тогда
		ШаблонКМТабакПоУмолчанию=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Пачка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтранаПоУмолчанию) Тогда
		//СтранаПоУмолчанию=Справочники.СтранаПроизводства_ХамелеонЦРПТ.НайтиПоКоду(643);
	Конецесли;
	
	Если СайтыВходаВСистему.Наименование="Молоко" Тогда
		ТипОплаты=Перечисления.ТипОплаты_ХамелеонЦРПТ.ОплатаПоНанесению;
	Конецесли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Вставить содержимое обработчика.
	Обработки._Запуск_ХамелеонЦРПТ.ОбновитьСправочникиТНВЭД(ЭтотОбъект.СайтыВходаВСистему.Наименование);
	
КонецПроцедуры
